{
  "belief_axis_meaning": [
    "Crime",
    "EDCA",
    "Energy_Issues_China",
    "Insurgent_Threats",
    "Labor_and_Migration_China",
    "Social_and_Economic_Issues_Philippines",
    "United_States_Military_Philippine"
  ],
  "polar_axis_meaning": [
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ],
    [
      "opposing",
      "supportive"
    ]
  ],
  "belief_dim": 7,
  "polar_dim": 2,
  "top_tweets": [
    [
      [
        "RT @cmfr CMFR mourns the passing of Luis V. Teodoro, a pillar of Philippine journalism, an esteemed colleague and friend. The Center will forever uphold his contribution to the work of building of a free and independent press and its role in Philippine democracy. https://t.co/5j5UKopi8r https://t.co/Zv3is7Qpio",
        "@Celestine_DKila The Murderers of the PATRIMONY of PH MOTHERLAND can be declared TERRORISM & HEINOUS CRIME by The League of United NATIONS. The CHINESE CITIZENSHIP must be removed in PH as NO LONGER PART of beloved PILIPINAS HISTORY for Stealing & Murder of PH independence on 12th June 1898 https://t.co/gryzwKSmsY",
        "@AP The Murderers of the PATRIMONY of PH MOTHERLAND can be declared CRIMINALS by The League of United NATIONS. The CITIZENSHIP of CHINESE must removed in PH as NO LONGER PART of beloved PILIPINAS HISTORY for Stealing & Murder PH independence this is HEINOUS CRIME! Chinese are Alien! https://t.co/F7SQgPWcxw",
        "@AnnaMalindogUy Chinese CPP/CCP Nationals are confirmed LOOTERS & Plunderers of Philippine History and Sovereignty and therefore we Pilipino People have right to REMOVE the NATIONALITY & CITIZENSHIP of Chinese in the Philippine Sovereignty as they are DESTROYING PH in their INTERNATIONAL CRIMES https://t.co/QOXz3oKsDH",
        "@ABMorayta @PandaySiningPH The Crimes of CCP and CPP of CHINA in the Philippines is the MOST unforgettable moment in Human History by STEALING the 1896 Blood of Pilipino Revolution for INDEPENDENCE of our Motherland and Diverted it into INDEPENDENCE & Revolution of the Terrorist Organizations of CHINA @PH https://t.co/O5x1HMEVtq",
        "RT @bulatlat At least four students were arrested by elements of the Manila Police District around 6 a.m. today after a lighting protest against Balikatan exercises in front of the US Embassy. Photo from @updkalasag . This is a developing story. https://t.co/9vp6UEYzRp",
        "RT @altermidya BREAKING from @paghimutad: BIEN Paralegal Officer Stabbed to Death in Bacolod Alex Dolorosa, paralegal officer of the BPO Industry Employees Network (BIEN) Philippines chapter in Bacolod City, was found dead with multiple stab wounds on April 24, 2023. https://t.co/ZfHiMDYyCl",
        "RT @DahasPH On 8-15 April, 10 were killed in Marcos Jr.'s drug war. Cotabato logs 6 deaths, 5 of w/c from a police raid. Cebu, now with 10 killings since the start of '23, is the 3rd hotspot in PH. So far, no state agents were involved in the Cebu killings. Sources: https://t.co/LgQKzDegGL https://t.co/tDkCdcwM9t",
        "RT @inquirerdotnet JUST IN: A person of interest in the case of John Matthew Salilig, the Adamson University student who died due to hazing, has been confirmed dead, according to Laguna Police Director Col. Randy Glen Silvio. | @JMangaluzINQ https://t.co/y8Z0xtttQu",
        "RT @kim1n4o From Tug-ani: the 2GO Group Inc, Cebu Port Authority, Maritime Police, and Philippine Coast Guard Region VII have all denied there being any commotion on the day. Dahil sa lumabas na video mula sa concerned citizen, nabisto ang kasinungalingan at kainutilan. #StopTheAttacks",
        "RT Š BANGUAL PUY OF GABRIEL AND JOANNE INCREASE! The Child of Lagun maintained a flagrant violation of our rights. It was to punish the brutality of police and the dependence on civilians. #Stop The Attacks #USTropsOunnow #DWOMBImponimic typs:/tcoc/wrezyz",
        "RT Warwickagator In expose by Senator Raffy Tulfo, one of those suspected of being involved in agricultural smugling is Michael Ma, a Chinese professed business partner by Martin Aranta-na brother of Unglang Liza Araneta-Morcos. otts:/tcococ./7rQHAnijw",
        "RT @IanMakabayan URGENT ALERT: we received reports that our paralegal officer in Bacolod City, Alex Dolorosa, was found dead with stab wounds yesterday. He was reported missing for 3 days and local reports confirmed he was killed in Brgy Alijis, Bacolod City. https://t.co/FFRB8v4lHJ",
        "RT @DahasPH On 1-7 April, 6 were killed in Marcos Jr.'s drug war, all of whom were reportedly pushers. At present, low-level peddlers compose 102 or 40% of those killed under Marcos Jr., about triple the current tally of those designated as HVTs (35 or 14%). Sources: https://t.co/M6ph8hhceQ https://t.co/qfPsz2oE7K",
        "RT SON SURFACE CEDRIC AND PATRICIA OW! According to the KARTAN Human Rights Alliance - Cagayan Valley, they received a report that two farmer organizers Patricia Nicole Cierva and Cedric Casaño, were abducted by 501st Infrantry Brigadade in May 18 at htps:/t.co/7vkGRVETv",
        "RT @coastguardph INCIDENT REPORT: The @coastguardph is currently investigating the recent incident at Ayungin Shoal involving a Filipino fishing boat and a China Coast Guard vessel that occurred on 09 January 2023. ✍️https://t.co/FKZ29QHlML #DOTrPH 🇵🇭 #CoastGuardPH #MaritimeSectorWorks https://t.co/fdWVb0MYJi",
        "RT wivesWUCSWCD_SC Kanind at two o’clock in the morning was consumed by fire and a first alarm came over a boarding house at the Tolan Street corner Lt. J. Francisco St. of the Barangay League Cross, Quezon City. BFP NCR Fare District Quezon City destroyed the fire before three o’clock in the morning. utps:/tco.S/DVOMBAB",
        "RT BADICRE! Kim Falyabu_natyl HUSTISY FOR THE VICTIMS OF NEW ISLOCRE! This is what Kim Falyo, Deputy Secretary-Genal of Youth of Youth for Tribu Filipino (Kotribu Youth), in Rev UP Fair 2023. #JusticeFHAN #Justefor.",
        "RT @LFSPhilippines We condemn the trumped-up charges of vandalism, illegal assembly, and resisting arrest against the six youth activists who participated in a lightning rally at the US Embassy against the Balikatan exercises earlier this morning. #FreeGabrielMagtibay #NoToBalikatanExercises https://t.co/LmHfku9p7R",
        "RT @TheKejOfGlory How to hold accountable people who are proportionally way responsible for poverty and other systemic problems? Those who actually rob us of billions of ₱₱₱? 1 Arouse fellow Fil masses 2 Organize, join #JoinNDMOs* such as @pilipinasscm 3 Mobilize from communities to streets"
      ],
      [
        "RT @maracepeda My first Insight package for @straits_times focuses on the stories of ordinary Filipinos caught in the middle of tensions between PH and China. We spoke with fishermen from Masinloc, Zambales, who still fear returning to Scarborough Shoal after years of Chinese harrassment. https://t.co/zdZWAgxQu1",
        "RT @gmanewsbreaking A fire hits MV DIAMOND HIGHWAY at the vicinity shoreline of Punta Engaño, Lapu-Lapu City, Cebu on Friday, the Philippine Coast Guard says. | @jovilandxrita https://t.co/goDjxi8dmr Video: PCG",
        "RT ęPSBalita 2 expert on illegal gambling in Rizal, Occiental Mindoro otts:/t.co/zvxZOwNWw",
        "RT @DonaldJTrumpJr Our corrupt elites aren't threatened by violent criminals on the streets because all of them have private security. They don't care if normal people are being terrorized. But they are threatened by Trump, which is why they're willing to turn us into a Banana Republic to stop him!",
        "RT ŠPSBalita Cagayan Valley Cops, who carried the Community Outreach program and Bloodleting activity otts:/t.co/adbFuzillL",
        "RT @Teddybird PhilHealth under my leadership will be fast, action oriented and responsible. We will achieve a HEALTHY PILIPINAS, ANG BAWAT BUHAY AY MAHALAGA!",
        "RT @mtaibbi Reality Winner is not a “spy.” The outrageous, authoritarian Espionage Act allows the government to call an American citizen talking to an American reporter espionage.",
        "RT ęPSBalita Php3.44M value of crack, seized on the bun-bust of Bacolod City PNP Againsts:/t.co/5nxYtJbtG",
        "RT @bongbongmarcos We reiterate our commitment to an effective and substantive Code of Conduct in the South China Sea and commend the emerging consensus among ASEAN member-states to address the situation in Myanmar. The 42nd ASEAN Summit Retreat Session emphasized our collective efforts to foster… https://t.co/HPgUGuscGO",
        "RT @SpokespersonCHN Qin said Shanghai, once dominated by foreign powers, is a forerunner today in China’s reform and opening up. A bustling and prosperous metropolis has risen from devastation since 1949. Now Shanghai is a shining hallmark of Chinese path to modernization.",
        "RT ęPSBalita Project Scholar, reconstructed by the Cagayan PNP ottps://t.co/AvNqsi9KsE",
        "RT ęPSBalita Php374K value of crack, confiscated by Bacolod City PNP hops:/t.co/MMa7Zojhah",
        "RT @PoliceUg . @HellenButoto \"The Directorate of Crime Intelligence in partnership with the territorial Police at Lugazi police Station, have successfully tracked down an individual who proclaimed himself as a member of the Allied Democratic Forces (ADF), a terrorist organization. The… https://t.co/6sl29ED5uo",
        "RT @tshugart3 A reminder that per Article 110 of UNCLOS, to which the PRC is a signatory, warships and government vessels should only board foreign vessels if they are suspected of piracy, slave trading, unauthorized broadcasting, illicit narcotics trade, or if they are stateless. https://t.co/ZpC1oSjX7K",
        "RT @PoliceUg Police dog captures suspect in Nakaseke Case of Animal Killing The Territorial Police in Nakaseke is investigating a case of Killing animals that occurred on the 25/05/2023 at around 400/C at Mabaale Village Kiwoko Town Council in Nakaseke district. The Police Canine… https://t.co/gdj1xBhNiU",
        "RT @PNPCordillera Eight police officers of PROCOR proudly received their awards from the Chief of the Philippine National Police (PNP), PGEN RODOLFO A AZURIN, JR., during his Command Visit in Camp Major Bado Dangwa, La Trinidad, Benguet on February 16, 2023. https://t.co/VmjRCJO109",
        "RT ŠPCADGOfficial Arestado two suspects after being caught with guns and drugs in Las Piñas City, February 5,2023. This activity aims to avoid deliberate criminality in the community in order to achieve a quiet and peaceful community. Hetps:/t.cocow/Do8FBxH",
        "RT @pcogovph President Ferdinand R. Marcos Jr. approved on Tuesday the creation of a single operating system for all government transactions to ensure ease of doing business in the country. Read: https://t.co/uuXn7qYHja https://t.co/czs1CqMlR0",
        "RT ==PTVph READ: President Ferdinand R. Mark Jr. strongly condemned the murder of Negros Oriental Gov. Roel Degam and promised that his administration would do everything to answer the indibidlds behind the crime. 1/3 hatps:/t.co/ezJP61PLw",
        "RT @PoliceUg Statement on Kassanda suicide by shooting @KawalaRachael \"Territorial police in Kassanda have registered attempted murder and suicide by shooting that occured at Makokoto police post Makokoto sub county in Kassanda District. The deceased is No.1037 PC Kitiyo Alex, a 47-year… https://t.co/VDqhvgweVh"
      ]
    ],
    [
      [
        "RT  wivescnphilippines ON FAYO: Malacañag Palace reveals the locations of four new EDCA sites: • Naval Base Camilo Osiah in Santa Ana, Cagayan • Lal-lo Airport in Lal-lo Airport, Cagayanyanyanan • Camp Melchor De Cruz in Gamu, Isabela • Bababa Island in StoryAN Soon on phsps:/tcok/ts/t.",
        "RT @ReynaValmores WHAT IS THE BALIKATAN EXERCISE AND WHY MUST WE OPPOSE IT? Here are key reasons why we must call for an end to the US-RP Balikatan exercise and the lop-sided military agreements between the US and the Philippines A comprehensive thread 🧵 #USTroopsOutNow https://t.co/wEqth5gZaG",
        "RT  Manueltaripnog  Brasil URGENT ALT April 12, 7:40PM, three vehicles that identified Agnes Mesina - Cagayan Valley Coordinator; Walter Villegas - Youngtylist CV Coordinorator and another after communications treatment of EDCA.tps:/tcog/P14Hpp",
        "RT @MangingisdaSays I hope Kakampinks who criticize them in the replies section understand the issue first. Two EDCA sites will be in Cagayan, which could endanger residents in the friction between US & China. We must not let ourselves be dragged into the inter-imperialist war between US & China!",
        "RT ABSCBNNews TINAN: Thousands of Cagayan residents have conducted candle lighting and paliotic communications this Monday, April 17, evening in Rizal Park, Tuguegarao City in opposition to the additional EDCA sites to be built in the area. (MAYA: Can PIO) typs:/co./AbbleHXPN",
        "RT @rapplerdotcom A group of Filipinos protest the arrival of Philippine president Ferdinand \"Bongbong\" Marcos Jr in the United States. Follow Rappler's coverage: https://t.co/UkjfsupSEB https://t.co/RFpBLwKhjF",
        "RT News5PH pointedly, Sen. Risa Hontiveros said that it was shameful for Chinese Ambassador Xilian to express the possible feeling of fellow migrant workers in Taiwan if the Philippines would continue to allow America to build an additional EDCA sites. #5 hatps:/tco./JlrUnd4Gn",
        "RT  wivesPTVph I was commissioned by President Ferdinand R. Mark Jr. in Filino-American actress and digital influencer Vanessa Anne Hudgens the Global Tourism Ambisador Award. (Courtesy: Presidential Communications Office) 1/3 hatps:/co/tovZg8XY",
        "STAND UP Cirperson Gabriel Stand! A violation of our right to free press has been arrested for the arrest of those who performed the lightning rally in the US Embasssy to protest EDCA and Barbian Excierses!",
        "RT ARTVERVillam What is EDCA, and why should we be concerned that there are the most ancient NEW EDCA sites in the country? Athread - EDCA or Enhanced Defense Cooperation Agrement agreement of US and PH to maintain the US military system and the US and military bases of its PH. thps:/tcocencencencenc/Vo81bH",
        "RT @ReynaValmores Today is Day 1 of the Balikatan exercise. Reports are already pouring in from Nueva Ecija, where farmers could hear the explosions of the live-fire exercise from the EDCA site. Residents express fears of leaving their homes and continuing their livelihood. #USTroopsOutNow",
        "RT ÖCarwyn_Candula Thulas is such a compressing state oath from the people of Cagayan. Kingship the EDCA base in Cagayan, they are himself one of the purges of potentially explosive imperial war. Their candle lighting ceremony is a sobering afterr of the imperial war takes.",
        "RT @altermidya LOOK: Members of the Filipino community in Washington led by Bayan USA, Malaya Movement, and ICHRP protested in front of Fiola Mare, a fine dining establishment in the high-end Georgetown neighborhood, where Marcos, Jr. and his cabinet dined with Filipino Tycoons. https://t.co/doVBP9x14Y",
        "RT @GabrielaWomenPL INFOGRAPHIC: More than 12,000 US troops will participate in the 2023 Balikatan exercises, the biggest in history, as live-fire drills are set to be conducted in West PH Sea and near Taiwan Strait. This is a rehearsal for war which Filipinos clearly do not want #USTroopsOutNow https://t.co/jNumA0EmGt",
        "RT ARTPH SUPPHINGCH ITETE: DO NOT DECURTE THE PERO BINEBENT? You know! Okay, let's pay him! We invite everyone to take part tomorrow, June 12, on Freedom Day to keep Mark from selling the country! #JunkEDCA # And The Snotps:/tco/R3bsiz0",
        "RT wivestower You are angry at EDCA but Not Anger at China’s Chinese Agression at WPS. Of POGO’s criminality. In SHABU from China.",
        "RT  yourselfCelestine_DKila KUDUS TOSENSA HONTIVEROS, for the research done and giving Films the updates. It is now hard for Pinoys to suffer, more than Mark Jr! Manic to the state of the Filipinos! HAYUPPPHES:/tco/WenXISGJ",
        "RT Šaltermidy VIOORIN: Biasata women have launched protest against the National Citizen Service Training Bill and extended Enhanced Defense Cooperation Agreedment (EDCA) to Mendiola, Manila today, March 3. (Vide from Gabriela Youth) hops:/tco/M93ZA4j9",
        "RT Šjmschumey if he's a filling here, you think he loves the Philippines so much. Concerning the idea that we're going to be good at EDCA. Did he think of this as they covered the ark of the town? The drama is enough, you can't fool us. Just turn back what you stole.",
        "RT @Bahaghari_PH “This war will never even happen in the US. It will not happen in China. This war will happen here, in the Philippines. It is Filipinos who will pay to maintain the dominance of the US”. Watch Al Jazeera’s (@ajplus) investigation on Balikatan: https://t.co/3PnOkQ8Hin https://t.co/5ElnlLeFlq"
      ],
      [
        "The Philippines' Marcos Jr. has granted the United States military expanded access to bases under the Enhanced Defense Cooperation Agreement, but a coalition of domestic actors that would resist EDCA implementation is forming. The latest from @Richeydarian https://t.co/rT4oSAjeQp https://t.co/WIB2Ocjs1j",
        "RT @IndoPac_Info 1) #Philippines announces 4 additional sites for military bases under the Enhanced Defense Cooperation Agreement with #US 1-Naval Base Camilo Osias in Sta Ana, Cagayan 2-Lal-lo Airport in Lal-lo, Cagayan 3-Camp Melchor Dela Cruz in Gamu, Isabela 4-Balabac Island in Palawan https://t.co/Jm6RGiRU57",
        "RT @theadtan Publishing my thoughts on EDCA soon. Too much fearmongering about this and accusing the government of a sharp pivot towards the U.S. Not defending BBM & DND here, but they are not pivoting closer to USA, they're just implementing what was agreed upon in 2014.",
        "RT @IndoPac_Info #US #Philippines & #Japan eye regular #SouthChinaSea exercises 3 way cooperation seen as key to deterring China along 'first island chain'. The US, Japan & the Philippines plan to coordinate security strategies in the East China Sea & South China Sea. https://t.co/CMplRWa2yf https://t.co/fJ9J2UrGBD",
        "RT @IndoPac_Info #Philippine military bases with #US access won’t be used for offensive actions, says Marcos This after Chinese FM spokesman warned that expanding the number of bases under EDCA may draw the Philippines “into a potential conflict in the #TaiwanStrait ” https://t.co/wFzccRVygz https://t.co/I5OgMzRFyU",
        "RT ŏSultress202 TAGANAW for PBBM’s dto that we would not use any of the EDCA bases for conflict, this is to increase knowledge for the dissasters to come and strengthen our country’s alliance. We will not fight or rush against them. ancebongmarcos ctto hops:/tco./B2NODWaOR",
        "RT @thonwingp Philippine leader Marcos broke a pledge to stay “balanced” in the US-China faceoff by allowing 4 new US military bases in his country. He thus betrayed Filipinos by pulling them into any superpower war. The neighbors have noticed - and wonder if he’s betrayed all Southeast Asia. https://t.co/4q1P8Nu0CB",
        "RT @IndoPac_Info #US Statement of Support for the #Philippines in the #SouthChinaSea implies that attacks oh PH Coast Guard ships are covered by the U.S. Philippines Mutual Defense Treaty This is big for the Philippines, but are they going to actually invoke the treaty? https://t.co/x2eF4DlUVo https://t.co/cfJ9WgfRKa",
        "RT @IndoPac_Info #Philippines, #Japan, #US coast guards to hold drills starting June 1 The week-long exercise would strengthen interoperability through communication exercises, maneuvering drills, maritime law enforcement training, search & rescue & passing exercises. https://t.co/xpEWnT2xle",
        "RT @IndoPac_Info 2) President Marcos: \"The main goal of new EDCA sites is to \"defend the country’s eastern coast\" as PH continental shelf on Luzon’s eastern side was also put into consideration.\" This is in response to China's encroachment in PH waters. This adds to the current 5 bases. https://t.co/JI5oUzbse0",
        "RT @IndoPac_Info #Philippine Congress Set to Approve Expanded #US Base Deal as #China Expands Claims, Ambassador in US Says \"China’s persistent expansion into the #SouthChinaSea is the main security concern for Philippines.\" “We won't give one inch of our territory.” https://t.co/57bkvxCdYE",
        "RT @bobitiglao Duterte: \"EDCA bases are platforms for war. \" But at whose national interest? Definitely not ours.\" Snubbed by media, Duterte warns of EDCA bases https://t.co/3N7muVPHmw",
        "RT @IndoPac_Info The #Philippines could be #Australia’s most important defence partner in SE Asia Philippines could be an important partner because of its location & potential willingness, as an ally of the US, to grant access & logistical support to Australian forces. https://t.co/UVHobkh51Q",
        "RT @IndoPac_Info 1) The tiny #Philippine island on the frontline of the #US #China battle for supremacy Fuga Island may become home to American troops as the US seeks to protect Taiwan and the region. Fuga has the topography to accommodate an airport and a seaport. https://t.co/AXjkHYJZHe https://t.co/7k74cVsqXO",
        "RT @Kanthan2030 Western values, American freedom and liberty. A Filipino baby and her mom inside a human zoo in NYC, US in 1906. (After committing genocide and slavery, the US decided to get into colonialism abroad. Thus, the US elites staged a false flag attack in Cuba and waged a war… https://t.co/sgP8HeXsso",
        "RT @theadtan 1/ My thoughts on EDCA It's quite long, so I'll post the screenshots of my post from FB. https://t.co/bzQ9mRKXrh",
        "RT @bobitiglao EDCA gives US two international airports to use for war with China https://t.co/8e0pNYTlWk",
        "RT @SecDef I had the opportunity to meet with @SecManalo for the 1st time since his appointment. We discussed cooperation on key priorities & reaffirmed our treaty commitments to the 🇵🇭Philippines under our Mutual Defense Treaty. I look forward to making more progress together in the future https://t.co/JJyyT9BdlM",
        "RT @IndoPac_Info 1) #US can't stockpile arms in #Philippines to defend #Taiwan, says 'friends to all' Manila After China's complain, Philippines said it won't allow the US to stockpile weapons that could be used to defend Taiwan on bases the US has access to under EDCA. https://t.co/R0QgIBIFJ1",
        "RT @theadtan I'm neutral on EDCA. I don't understand the complaints about it. There's really nothing new since PH-US signed the agreement in 2014."
      ]
    ],
    [
      [
        "RT @cnnphilippines BREAKING: Voting 12-2-1, SC voids the Tripartite Agreement for Joint Marine Seismic Undertaking by and among China National Offshore Oil Corporation (CNOOC), Vietnam Oil and Gas Corporation (PETROVIETNAM), and Philippine National Oil Company (PNOC). | @anjocalimario https://t.co/4YdaQGRQJj",
        "RT @SpeakerMcCarthy Republicans in the House of Reps are working for you: ➡️ Cut Democrats' army of 87,000 new IRS agents ➡️ Ended radical, soft-on-crime policies in Washington DC ➡️ Stopped the sale of Strategic Petroleum Reserves to China https://t.co/uvdL1Ks0dn",
        "RT @RepTroyNehls Why did 97 Democrats vote against a ban on selling American oil to China?",
        "RT @EmeraldRobinson What they want to do in 2023: Biden signs illegal treaty granting “pandemic” control to WHO (run by China). A new pandemic will be announced. WHO will demand lockdowns & vaccine passports in the West. The USA will be a tyranny under emergency law.",
        "RT @SteveScalise It’s been 4 weeks since more than 100 House Democrats joined House Republicans to pass a bipartisan bill that bans Biden from selling more oil from America’s Strategic Petroleum Reserve to China. Yet the Senate still refuses to even take it up. Do your job.",
        "RT @KanekoaTheGreat Joe Biden's proxy war against Russia continues to push Saudi Arabia into a deeper alliance with China and Russia — over the last few months: 1. Saudi Arabia joined Shanghai Cooperation Organization led by China, Russia, India, and other nations 2. Saudi Arabia cut oil… https://t.co/t2mnLYVhdz",
        "RT @HawleyMO Joe Biden groveled to China and made us dependent on Chinese energy - and now Beijing is building a spy station in our backyard. When will Biden stop making China rich and start protecting America https://t.co/ftk90aXyLe",
        "RT @WarClandestine These are the 12 points in China’s proposal. They sound pretty reasonable tbh. -Respecting the sovereignty of all countries -Abandoning the Cold War mentality -Ceasing hostilities -Resuming peace talks -Resolving the humanitarian crisis -Protecting civilians and POWs -Keeping… https://t.co/TJKIN13S8S",
        "RT @RepTiffany Democrats refused to hold a SINGLE hearing on the origins of COVID-19. The White House refuses to admit that COVID came from a lab leak. Why are Democrats continuing to protect Communist China? https://t.co/hLo71Yn8m6",
        "RT @pepesgrandma 🔥 Now there are SIX Chinese police stations in the United States! This is huge, when China invades Taiwan, these Chinese stations can provide military support by organizing Chinese in the US to damage US networks, power grids, or even launching terror attacks. And what about…",
        "RT @KimDotcom All Russia and China have to do is the gradual de-dollarization of global trade with their BRICS+ partners and wait. No escalation. No overreaction to US provocations. Patience and time. Within 3 years the US Govt runs out of oxygen. Just listen and chill: https://t.co/lPOtJsghmm",
        "RT @RealAmVoice “We’re playing right into the hands of China.” President @realDonaldTrump SLAMS the green energy and electric vehicle push by the Democrats and Biden administration. Watch LIVE➡ https://t.co/aeKhZCtVbe Watch the full interview on Rumble here: https://t.co/1vCK0MGXDo https://t.co/A5igVXeVMf",
        "RT @JohnMcC61971366 “Yeah, imagine that Josh. Imagine a strange, dark timeline where China is encircling the US with military bases and weapons of war. You know, in literally the exact same way the US is doing to China right now.” https://t.co/fhSpqURTvP",
        "RT @WarClandestine 1) China are not trying to “interfere” in the investigation into the origins of C19… China oppose that the committee already decided that China are “complicit”. It’s not an “investigation” when you’ve already decided who’s at fault. US actors created SARS-CoV-2. Not China.",
        "RT @PeImeniPusha An activist interrupted Blinken's speech, calling for negotiations with Russia because the U.S. is waging a dangerous proxy war. \"If you don't like China's proposals, where are your peace proposals?\" the woman asked. https://t.co/kZS6tkIUa6",
        "RT @RickyDoggin Biden shut down the Keystone pipeline and coal mines only to buy oil from socialists Venezuela. This happened while the administration allowed China to take advantage of our oil reserves and outmaneuver us on trade deals. https://t.co/L38n27mQYs",
        "RT @WarClandestine Many still don’t realize it, but WW3 is already well underway. Russian and Chinese MIL have already been cooperating via sharing intelligence surrounding the US biological network. Now it looks like they are coordinating forces should things escalate when China invades Taiwan.",
        "RT @teddyboylocsin When we worked with US, followed its instructions, we lost our shoal; we never lost a drop of water or a cup of sand under strongman Duterte. We tried working with China; then I terminated the MOU on Oil & Gas and restored the Visiting Forces Agreement on better terms.",
        "RT @Byron_Wan Philippine authorities warned China of “serious repercussions” if buoys installed last week within Manila’s exclusive economic zone in the South China Sea are removed from contested waters. https://t.co/ZrH6hXRSrs",
        "RT @BenjaminNorton Neocolonialist Tucker Carlson complains that China is building infrastructure in the Caribbean, in countries that he proudly refers to as US \"colonies\", and - implicitly invoking the 200-year-old Monroe Doctrine - he says the region should all be controlled by the US empire."
      ],
      [
        "RT @RepMattGaetz BREAKING: China is operating an intelligence-gathering platform masquerading as an oil rig in the Gulf of Mexico. Meanwhile, America’s Gulf Test Range, where we test military capabilities to defeat China, is currently shut down due to the “discovery” of 51 whales. A serious… https://t.co/R1bRH6pCjG",
        "RT @globaltimesnews #GTVoice: The US reportedly urges SK not to fill chip shortfall in China if Micron banned. The news underscores the awkward situation facing SK's chip sector given squeezed room under US hegemony and bullying. https://t.co/GoZoVfDEGd",
        "RT @globaltimesnews The US' \"decoupling\" and containment strategy against China is in trouble – Washington is getting lonely as many of its key allies, like France, and domestic companies like Intel and Tesla, refuse to follow White House's hostile China policy https://t.co/jqcNk9FaSp",
        "RT @JoeyFromPhilly China doesn’t need to deplete their military resources to defeat America. Just support Biden 2024. He’ll do the rest.",
        "RT @upholdreality China MFA Spokesman WANG WENBIN: \"It must be pointed out that the US blames China for exporting “fentanyl precursors”, which are in fact only ordinary chemicals sold through normal trade. In international trade, it is the importer’s duty to prevent such chemicals from falling… https://t.co/p7KJ33oYcK",
        "RT @mattybach1 \"So much of the propaganda indoctrination we’re subjected to in the 2020s revolves around convincing people to believe that Russia and China should react completely differently than the way the US would react if foreign proxy forces were being amassed along its borders.\" @caitoz",
        "RT @caitoz Anyone who thinks the US would allow China to place a military base in Mexico for even one second is a propaganda-addled manchild. That's my point: the US is militarily encircling China in ways it would never allow itself to be encircled, and is therefore the clear aggressor.",
        "This is where Tanghalang Pilipino’s latest remounting of one of its well-received plays, “Ang Pag-uusig” comes in. It’s a play packed with parallels about the plight of today’s Filipinos and the country’s political landscape. Read more: https://t.co/2ewloJYiEv https://t.co/lO93nsKYff",
        "RT @globaltimesnews In response to US' national security concerns over the use of TikTok, the Chinese Foreign Ministry said on Fri China never has and never will ask firms or individuals to violate local laws to collect or provide data and information stored within other countries' borders. https://t.co/TGbxa7cdQf",
        "RT @Kanthan2030 China is the world’s #1 manufacturer of cars and the #2 exporter of cars. And China’s #1 customer is… Putin! I mean, Russia. The U.S. and its non-sovereign puppet continent known as Europe must understand that the world has become more self-sufficient and resilient. The… https://t.co/TVwgLVHcmb",
        "RT @globaltimesnews Chinese President Xi Jinping said on Tuesday that #China is ready to expand cooperation with #Russia in trade, investment, supply chain, mega projects, energy and hi-tech areas: Xinhua https://t.co/0Nv6kXtNow https://t.co/FXqgBdqYSB",
        "RT @BrianJBerletic The US had a narrow window of opportunity to shape the planet before Russia reasserted itself & China rose upon the global stage. The window is closing and Washington's panic is manifesting as ill-conceived proxy conflicts from Ukraine to the island province of Taiwan...",
        "RT @MFA_China Using competition as a pretext to take down China and deprive China of its right to development is not “responsible competition”, but irresponsible bullyism. It will only push China and the US towards confrontation and divide the world. https://t.co/ms0RD5iJon",
        "RT @chenweihua It’s such a joke that Chris Christie on the fake news channel CNN claimed that the Russia-Ukraine conflict is China’s proxy war 😂because China buys Russian energy. In fact, India and many others buy Russian oil. EU was still the largest Russian energy buyer in 2022. That is why… https://t.co/eEBc6pIwks",
        "RT @PhilippineStar JUST IN: The country’s outstanding debt hits a new record-high of P13.91 trillion as of April after the additional P54 billion in obligations during the month. The running debt incurred by the Marcos administration stands at P1.11 trillion in 10 months. | @maureensimeon https://t.co/axAesjjenc",
        "RT @XHNews Early summer is one of the most enchanting seasons for the city of Maoming in south China's Guangdong, as the harvest season for lychees begins in the country's largest lychee production base https://t.co/dqA2pr4LQu https://t.co/xyGKvn3zKL",
        "RT @Kanthan2030 Elon Musk is in Beijing. He will meet with top CPC (“CCP”) officials - including new Premier Li Qiang. Plans to expand Shanghai Gigafactory. US politicians go berserk when talking about “communist” China, except when kissing ass to make money. 🤡 https://t.co/sckB1RVKFY",
        "RT @BenjaminNorton China has arrested the billionaire owner of commodities trading giant Cedar, Zhang Jin, for illegal fundraising estimated at c. US$3 billion. In the US, corrupt billionaire oligarchs have impunity, and basically control government policy. Not in China. https://t.co/B6aekKSEKn",
        "RT @NiMingda_GG 6/ The nine-dash line is based on China's historic sovereignty over the islands before the UN existed. Disputes also exist between other ASEAN countries, not just with China. And all disputes are being managed diplomatically. They're none of the U.S. or Australia's business.",
        "RT öbongmarcos Our inauguration at the start of the National House for Filipino (4PH) Project in the Lawan Hills, Quezon City is only the beginning of our dream of having decent and affordable housing for our countrymen. HTtps:/t.co/Cu65nZQ"
      ]
    ],
    [
      [
        "RT @MalcolmNance The sub imploded 1.5 hours after descent LAST SUNDAY USCG not notified for 8 hours LATER. SINCE THE LAWS OF SPACE & TIME don’t apply to MAGA, why didn’t @dancrenshaw just parachute in and dive 1000m on first notice? Did he forget about gear preps and briefings? Flight times,…",
        "ROSA’S HISTORY! It wins Filipinos against a power - driven dictator, human rights abuse, corruption, and theft of the people. pains:/tco./AbMscv18",
        "RT @JYSexton Let's be very clear: Marjorie Taylor Greene is openly calling for secession and engaging in active sedition. It's not a joke. It's part of the larger authoritarian project. And, for the record, it's time we stop joking about letting \"Red States\" go. 1/ https://t.co/l3HDI9YYZ4",
        "RT @RadioFreeTom Or, you know, an out of control authoritarian sociopath who will issue mass pardons to J6 insurrectionists and continue his personal war with the government and Constitution of the United States from inside the White House while holding the nuclear codes as Commander in Chief.",
        "RT @TitiEyi In Tigray There is no access to chemicals to spray and control the locust swarms, making it difficult to combat the problem. #SaveTigray @TitiEyi",
        "RT @ProjectGunitaPH We maintain these historical facts: 1. Ferdinand and Imelda Marcos were conjugal dictators. 2. The Marcos dictatorship murdered and massacred tens of thousands of Filipinos. Imelda was complicit. 3. The Marcos conjugal dictators stole from PH coffers. Imelda is a convicted thief.",
        "RT @blackintheempir China won and they did it without coups, sanctions, assassinations, invasions and bullying and on top of that they've managed to improve life in their country over the past few decades, unlike the United States.",
        "RT Šnatoreyes How bad the situation was, and the transport strike took place but: 1. Marcos did not give a talk about it 2. MMDA and LTFRB 3.",
        "RT @SaltAndReality During Martial Law, Ferdinand Marcos banned Voltes V. The Mecha tv series featured earths' struggle against the tyrannical alien Boazanian Empire. With 4 episodes left& Earth about to overthrow the evil Boazanians it was cancelled. Filipinos compared Marcos to the Bozanian Empire https://t.co/8qHXxt9SB1",
        "RT @historyphils On January 20, 1872, the Cavite Mutiny was undertaken by some 200 Filipino workers and soldiers. The suppression of the revolt led to the execution of three Filipino priests, namely Mariano Gomes, Jose Burgos, and Jacinto Zamora. #FilipinoHistorian #History #Gomburza #Majoha https://t.co/7sYk4sumFm",
        "RT @manilabulletin President Ferdinand \"Bongbong\" Marcos Jr. said it was important that the youth would learn about the country's history so they would not repeat past mistakes and have a better sense of what it means to be a Filipino. #ManilaBulletin READ: https://t.co/d6mANaBAQA https://t.co/sGg5X4OjOX",
        "RT @HawazGirmay 1/15 In Tigray There is no access to chemicals to spray and control the locust swarms, making it difficult to combat the problem. #SaveTigray https://t.co/FppdLCyvNl",
        "RT @josephscalice So excited to reveal the cover of my book! The Drama of Dictatorship: Martial Law and the Communist Parties of the Philippines. Coming soon from @CornellPress. https://t.co/PycflauBAn https://t.co/sIWM1Jt54A",
        "RT @KUglyton She really wants to end the NPA. PBBM's time frame to end the insurgency is 2 years. With VP Sara as the new Co-Chair of the NTF-ELCAC, I'm very confident it will end early. The presence of ES Bersamin is a big slap to the lady anchor of SMNI. For those people who still find EO… https://t.co/2pqnylwQDA https://t.co/cyLJa9obzw",
        "RT @NotaTory67 What is meant by “disruption”, “protest” and “undermining”? How can anti-monarchists, republicans or anyone irked by the cost of the coronation mark their dissent without being dealt with “robustly”? Your reputation is already bad enough without this sinister, authoritarian crap.",
        "RT @JYSexton With the GOP openly calling for secession and using a stolen court to roll back progress and state power to ban books and attack people, it’s way past time to face facts. As I warn about in THE MIDNIGHT KINGDOM, we are facing an authoritarian crisis. https://t.co/zwSUw2e50v",
        "RT @historyphils Every June 29 is commemorated as the foundation of Cagayan as a Spanish province in 1583. However, it supposedly endured a \"Japanese pirate invasion\" just a year earlier, in 1582. Learn more on the 1582 Cagayan battles: https://t.co/Jgj5o2kXOB #FilipinoHistorian #AggaoNacCagayan https://t.co/aX315iB3Ky",
        "RT @apocalypseos “It is the US, not China, that is throwing weapons on the battlefield. The US is in no position to tell China what to do. We will never tolerate the US pointing the finger, or even coercing and putting pressure on our relationship with Russia.” — Wang Wenbin https://t.co/xoJFwZvGoS",
        "RT @KatiePhang @RepAndyBiggsAZ Why would you need a pardon after January 6th?…What kind of “third world authoritarian” insurrection were you planning with Paul Gosar and Mo Brooks, per Ali Alexander?…",
        "All religions, totalitarian rulers, authoritarian govts, use the same human frailties to capture & enslave. Too easy, so many people want to be told what to do, to believe in a father figure who cares for them. Being told to love someone you fear, essence of sado-masochism."
      ],
      [
        "#TodayInHistory Today marks the 37th anniversary of the 1986 People Power Revolution, a historic movement that led to the ouster of late dictator Ferdinand Marcos and the restoration of democracy in the Philippines. https://t.co/hq7BxYyseJ",
        "RT @BandilangItimPH June 5, 1871, anarchist Michele Angiolillo was born. He would go on to assassinate the Spanish prime minister in revenge for anti-anarchist suppression and for the execution of Filipino polymath Jose Rizal. Mabuhay ka! You have acted where Filipinos could not. https://t.co/ESDuJPBVHz",
        "RT @NzePatoh Welcome remarks: \"Our goal as @hivecolab is to bring to people together & work to improve the world & livelihoods especially with the technologies emerging.\" @BarbsBirungi Co-Founder and CEO #Swarm23 https://t.co/n9mXRDBU6D",
        "RT öbongmarcos Expect that your support will go a long way, especially and on the basis of success in the programs we provide for the development of each Filipino. ottps://t.co/gzUkq1DHZ",
        "RT @ActivistHT_2 International pressure and support is the part of factor to start revolution. After all Leila de lima is biggest threat to the Marcos-duterte administration. Her release in detention facility will be the downfall and also her pain will be motivation against them. https://t.co/oX2SUOsJ0Y",
        "RT @kapwa_katip Thirty-seven years ago, the Philippines experienced the potential of collective power. Last year, another Marcos seized the presidency. How do we reconcile these two events? Read KAPWA’s analysis in the statement below. https://t.co/oU60SGxqZj",
        "RT @Aaron_MatthewIL 🇵🇭🇺🇸🇦🇺 Balikatan 2023 concluded today after 17 days of exercises across the Philippine archipelago. It was the largest iteration of the exercise to date, and had many firsts within in it such as an increased emphasis on Batanes and a SINKEX on the South China Sea. 1/3 https://t.co/VuVIbX9Ofh",
        "RT kasalukuyangRolandR19327469 If we really fight our laid jeepney, let us make it a modern - day invention that will not lose its original and traditional design, so that we do not allow China to replace it with the greed of human governments.",
        "RT @butchanarchy Let’s go even further than just critique the authoritarian institution of school, keep digging up the roots! What would happen if we opened ourselves up to inquiring about the values laden in the conceptualization that education is something that can be “given” Teacher ➡️ Student",
        "RT @butchanarchy There are always more questions to ask! There are always more options for exploration than we are presented by authoritarian hegemony. That many of us are not accustomed to analyzing and exploring this way is, itself, a symptom of how our society approaches learning.",
        "RT öCamposJuledna Franklin Ysaac 1 of 2 recalls, resurrected , and freshen 1986 peaceful wars and let us never again allow the ruining of our town! Our town is a legacy of meaningful music to our people’s love ! We cry for a return to the past. . ottps:/co./1awnYIDb",
        "RT @Aaron_MatthewIL Documenting Balikatan 2023: This year’s exercise is the largest to date, with around 17k participants and new activities. The following 🧵 details the various activities and developments in relation to #Balikatan2023 as they come out. https://t.co/EUVRS6RKhB",
        "It's his enemies who're the sphase out. VP Sara is our seventh. If D30 could, Dad e. Just pe-phase out of CPP-NDF is our seventh. That's one of the best legor's kind.",
        "RT ÖRyanLingo_ You think you're going to have someone else call on your EDSA People Power. The Filipinos are tired of the power graying, calling down evil on the instigators of the fake revolution.",
        "RT @ChristianusRick Here's the video why EDSA 1 is bloody Revolutions. Thanks to Ferdinand Marcos Sr. But, shame on you America, you abducted the Marcos Family and bring them to Hawaii instead of POAY! https://t.co/90lXqUUqUt",
        "RT @NATO_AIRCOM The multinational exercise with 🇵🇹🇧🇪🇩🇰🇩🇪🇳🇱🇵🇱🇪🇸🇺🇸 Real Thaw hosted in & by 🇵🇹 Creating realistic, simulated scenarios so participants can effectively respond in joint & combined operations, enhancing interoperability Read more: https://t.co/V6af41PeEg #StrongerTogether https://t.co/CQCuNKU3hy",
        "RT @pcogovph The idea of building a Metro Manila subway started to materialize Monday as PBBM led the launching of the Tunnel Boring Machine in Valenzuela City after his father, former President Ferdinand E. Marcos Sr., conceptualized it several decades ago. READ: https://t.co/VRZEOPlpb9 https://t.co/yLlmLnIoFf",
        "RT @societyofhonor PCG is the best. They understand sovereignty and transparency. Courageous, compassionate. Strategic. Tactical. The best of the best.",
        "RT @interaksyon The exercises are designed to improve search and rescue collaboration and law enforcement. https://t.co/SeNq1jMT9M",
        "RT öbongmarcos We are grateful for the warm welcome of the Camarines Sur when we led the groundbreking of two locations of our National Home for the Filipino Program. ottps://t.co/EVRQNXgx"
      ]
    ],
    [
      [
        "RT @reneeAZpatriot4 Homeland Security Committee Chairman said that China is likely sending military personnel into the US across the southern border Why is Biden Ignoring the Chinese Invasion? As many as 400K military-aged Chinese nationals have entered since he took office https://t.co/ZJXoC15S79",
        "RT @SayNoToSino #TsaiIngwen #tsai #Taiwan #TaiwaneseAmerican #TaiwanIsaCountry 🇹🇼🇹🇼🇹🇼 . Taiwan is an independent democratic country which never has been and never will be part of communist China🇨🇳 https://t.co/mKbRN6QCpS",
        "RT @JosepBorrellF Unacceptable remarks of the Chinese Ambassador to France questioning the sovereignty of the countries which became independent with the end of the Soviet Union in 1991. The EU can only suppose these declarations do not represent China’s official policy.",
        "RT @NiMingda_GG 1/ The Australian government & media is deceiving the public about the true purpose of AUKUS. The military pact is sold to the public as necessary to defend against a \"growing Chinese threat\". In reality, it's meant to assist the U.S. in future offensive wars against China.",
        "RT @JohnBasham BREAKING: Massive Lines Of Military Aged Men From #China Are Lining Up In #Panama Headed For The #UnitedStates Open Southern Border! This Is An #Invasion That Neither Governor's Or The President Is Stopping! https://t.co/p5UkJrSwzk",
        "RT @RosannaM1970 So many Chinese men are coming into America, that are military age. Why, are they coming here? My suspicion is that when China attacks Taiwan, we will be at war with them. Thousands we be positioned to work against America. Send them back to China. https://t.co/ZFawn26HDz",
        "RT @EmeraldRobinson Remember: WEF chief Klaus Schwab in 2022 called China \"a role model for many countries.\" Schwab's role is to make the democratic West more like communist China -- not the other way around. That's why WEF hopes to sell you on the idea of \"owning nothing\" like a Chinese peasant.",
        "RT @RonnyJacksonTX The Global Pandemic Treaty would SURRENDER America’s sovereignty to the WHO. The WHO is ANTI-AMERICAN to its core, and it was 100% complicit in helping China COVER UP the origins of COVID. We will STOP any tax dollars from funding this. This treaty MUST be rejected at all costs!",
        "RT @KariLake Our Great Country has seen an influx of National Security threats thanks to Joe Biden’s nonexistent leadership & obvious allegiance to China. In hindsight, turning our Military into a Woke Social Justice project probably wasn’t the best idea.",
        "RT @bethangsioco So tayo ang nakikiusap sa China? The issue is WPS is ours and China should not meddle with our territory.",
        "RT @GordianKnotRay For the past week--since #Vietnam went public with complaints about #China's research ship Haiyang Dizhi 4 encroaching into its exclusive economic zone--a Vietnamese Fisheries Surveillance vessel has been closely shadowing its activity. #SouthChinaSea https://t.co/L8iGb3Wz3c",
        "RT @bainjal When will @DrSJaishankar summon the Chinese ambassador on the issue of China renaming 11 places in Arunachal Pradesh? Has the ambassador been summoned on China’s aggression & occupation of our territory even once?",
        "RT @TerryGlavin Infamous in #YVR for urging more wealth migration from China into the housing market, Woo's maiden speech in the senate urged Canadians to shut up about China's annexation of the South China Sea. It's not some fluke. It's why he was appointed.",
        "RT @GordonGChang We must stop #China’s infiltration of its military personnel into #America and find all who have already entered. Why is this not the top priority of the #BidenAdministration?",
        "RT @PingpingTweets If @bongbongmarcos had a spine this guy would have been in a flight back to his pig 🐖 sty called China. https://t.co/ulei5TTQn3",
        "RT @JayBatongbacal So the threats are official now. The United Front Works people didn’t do a good enough job. China to PH: Oppose Taiwan independence if you care for 150k OFWs https://t.co/VrI0CcZqCo via @gmanews",
        "RT @GordianKnotRay 9 March 2023, nearly two years after #China explained its ships were moored at Whitsun Reef--within the #Philippines' exclusive economic zone--due to \"rough sea conditions\". It's remarkable how \"sea conditions\" never seem to improve enough for them to leave. Image: @planet https://t.co/BkfCnNKtlf",
        "RT @ruminarist MANY PINOY pulanggots and ddshits living abroad who enjoy the full freedom of a democratic society want to deny us and experience the same freedom here in the Philippines. To be fair, they should be living in China or North Korea instead. 🤔🤨😠",
        "RT @GordianKnotRay 1/Six @USTreasury-sanctioned ships belonging to an infamous #IUU fishing enterprise from #China have been plying the Philippine Sea for the past 2 months, just outside the #Philippines' exclusive economic zone. [🧵1/5] https://t.co/mDzzCNEEI7",
        "RT @paulsperry_ The # of Border Patrol \"encounters\" w/ illegal immigrants from communist China totaled >4,200 from Oct 2022 to Feb 2023, more than double the >1,900 for the entire fiscal year 2022, US Customs and Border Protection data reveal. Most of the Chinese nationals were military age men"
      ],
      [
        "RT @ClareDalyMEP Shameful displays of colonial arrogance towards China should be left in the past. The issue is simple. Do we want to be a vassal of our Atlantic friends, or have peaceful, independent relations with our largest trading partner, which hasn't dropped a bomb on anyone in 40 years? https://t.co/9hfs4CuikR",
        "RT @caitoz Imagine If China Did To The US What The US Is Doing To China \"Your brain would have to be made of soup not to look at that graphic and understand who the real aggressor is here.\" https://t.co/LRpOjqA6Hp",
        "RT @RichardJBardon Haha, no. Taiwan has no \"sovereign territory\" because it is universally legally recognised (including by the US & its own government) as part of China. Nor can the US claim transit rights contingent to a treaty (UNCLOS) it has not ratified. Go back to school.",
        "RT @Kanthan2030 The impressive \"China Model\" that emerged as the clear winner in the last 20 years.👇 Western neoliberalism has languished. And they have no explanation other than crying, \"But we have freedom and democracy.\" The fake logic here is, of course, that somehow freedom and democracy… https://t.co/B9oSyRoaN2",
        "RT @BrianJBerletic This article, from top to bottom, captures perfectly why Australia is transforming itself into a disposable proxy of Washington's war on China. Fears Australians hold regarding China usurping their sovereignty have already been realized, but at the hands of the Americans.",
        "RT @Kanthan2030 Uyghurs are less than 0.1% of China’s population. There’s no need for the Chinese government to harass them. However, it also shows how foreign subversion can create massive instability and worldwide propaganda using 1% of 0.1%. The US efforts failed spectacularly but still… https://t.co/RxqXVkASMq",
        "RT @wallacemick We had a very good meeting today in Beijing with the European Affairs International Department Central Committee CPC - The #EU needs to develop an Independent approach to #China that best serves the interests of the people of Europe and China... https://t.co/3bmnKoiz6U",
        "RT @OopsGuess Singapore Prime Minister Lee Hsien Loong: China believes that \"one China\" is the reddest of all its red lines, and China will never allow anyone to cross this red line. The U.S. Democrats and Republicans have reached a consensus that China's growing strength and self-confidence… https://t.co/ITKTEFxe4p",
        "RT @Norlaine So, it looks like China did meddle in our elections, but not out of love for the Liberals. No. It seems their end goal was to replace O'Toole with Poilievre as CPC leader. So, if Pierre keeps rabbitting on about an inquiry, he may get more truth than he wants.",
        "RT @RealPepeEscobar European clowns landing in China will be politely dismissed - at best. Zero sovereignty = zero respect. With business CEOs is another story: both sides will talk business. With priorities set by Beijing.",
        "RT @Kanthan2030 Oh, no! Research across 19 countries show that Chinese media is quite effective in convincing people about the benefits of the “China model.” 😂 After watching clips from CGTN, 54% said that Chinese system was better than US! New Harvard/Yale study: https://t.co/NIvlfVtDcG",
        "RT @caitoz For thousands of years China has been sorting out its own affairs without the help of white westerners concern trolling about territorial sovereignty and human rights. They don't suddenly now need our help because something something rules-based order. Leave China to China.",
        "RT @Bevin83994661 One of the most laughable arguments advanced by the US is that \"China claims islets in the South China Sea TOO FAR from China's mainland to be valid\". The US treats the Pacific Ocean as if it's an American lake!",
        "RT @RichardSHeggie 5 years of relentless anti- China propaganda, engineered by the US govt, US military, CIA & weapons companies has successfully entrenched increased negativity from OZ people to China. Sad & false - but also socially devastating & cataclysmically dangerous. https://t.co/zRSyPUh1JW",
        "RT @NiMingda_GG @SariArhoHavren @HKgrizzly China isn't alone. Most of Asia, Africa & Latin America are with China. So is Russia. China is not part of the U.S. led Western coloniser club. That's a good thing.",
        "RT @SpiritofHo The U.S. doesn't belong in the South China Sea. It has no right to lecture China on the South *China* Sea.",
        "RT @RebeccaYChan Yankees squat all over Asia to surround China in order to impose White Supremacist domination on 1.4 billion Chinese people. The Americans market their white supremacy under “freedom and democracy”. But we see them for the white supremacists that are and have always been.",
        "RT @NiMingda_GG Any country that plays on both sides of the U.S. - China rivalry should remember this: Standing on two boats moving in the opposite direction is a balls breaking exercise. Pick a side or be completely *neutral. *(If you hosts U.S. military bases/personnel, you're not neutral).",
        "RT @winter_canada Accusing a Chinese MP of secretly working for China is inherently racist unless you can prove it’s true. The media hasn’t done so. https://t.co/nYVvzOIlbm",
        "RT @AndyBxxx #HongKong had a short blip in history where it was taken over by drug cartel, colonialist thieves who treated you like animals. You are Chinese. Hong Kong is part of China. The UK / West doesn’t care about you except as a pawn. Stop fantasizing and accept the reality."
      ]
    ],
    [
      [
        "RT @SaltAndReality In the 70s Marcos Sr created sugar monopoly PhilSuCom & Nasutra controlled by crony Roberto Benedicto. They didn't fairly remit payments to planters which created the FAMINE OF NEGROS. By 1985 Negros lost 190K jobs, 1million experienced famine & over 100,000 children malnourished https://t.co/EdljsgbuXt",
        "RT @rapplerdotcom Faculty of the UP School of Economics bluntly say Marcos' P500-billion Maharlika Investment Fund 'violates fundamental principles of economics and finance and poses serious risks to the economy and the public sector.' https://t.co/KCZC4J1qTB",
        "RT @SaltAndReality Did You Know? Under PNoy, we were the real Economic Tiger of Asia. In the 6 years under PNoy, we grew an average of 6.2% GDP growth rate, the highest average growth among presidents including the fake Marcos Golden Age that only averaged 3.85% and contracted -2.08% from 1981-85🇵🇭 https://t.co/IGRWzf9MWz",
        "RT @SaltAndReality Did You Know? The Skyway Stage 3 that connects NLEX and SLEX is a PPP project of PNoy. It was part of the Skyway masterplan under Ramos (not Marcos) & approved by PNoy in 2013 & launched 2014. It was inaugurated in 2021 w/ Du30 credit grabbing as BBB. NO MAHARLIKA FUND NEEDED 🇵🇭 https://t.co/AyHLPg8qSN",
        "RT @SaltAndReality Did You Know? Under PNoy, we recorded the lowest ave. inflation rate among ALL PRESIDENTS since 1958 including MarcosSr. In 2015, the Philippines only had 1.4% inflation rate w/ PNoy's 6 year ave. inflation at 2.8%. Under Marcos Sr inflation was 41% in '74, 50% in '84 &23% in '85 https://t.co/5iUuUhlC93",
        "RT @leisbeth_recto \"Can a country’s president bankrupt its Central Bank? YES. Ferdinand Marcos did that in 1983. It had to be dissolved and replaced by the Bangko Sentral ng Pilipinas. Generations of taxpayers not yet born during Marcos’ time are still paying for those bad loans.\" - Philstar",
        "RT @PhilippineStar JUST IN: The country’s outstanding debt hits a new record-high of P13.91 trillion as of April after the additional P54 billion in obligations during the month. The running debt incurred by the Marcos administration stands at P1.11 trillion in 10 months. | @maureensimeon https://t.co/axAesjjenc",
        "RT @IanMakabayan Notice how Malacañang secretly missed out the 70 delegation of Marcos to Switzerland. No PR about this in any media, even state-owned Big economies like India and the US have only anywhere between 7-15 delegation. Bakit 70 ang sa Pilipinas at bakit may kasamang artista?",
        "RT @WIONews Philippines President #FerdinandMarcosJr unveils proposed sovereign wealth fund in Switzerland. Critics say that Marcos Jr has returned to the 'crime scene'. @Mohammed11Saleh brings you this report #Davos2023 | #WorldEconomicForum Watch more: https://t.co/AXC5qRugeb https://t.co/TecXngP4nD",
        "RT @ABSCBNNews On December 2021, the BIR sent a demand letter to the Marcoses to pay their estate tax dues which has ballooned from about P23 billion in 1997 to P203 billion. FULL STORY: https://t.co/mGnkTBSBTg https://t.co/inrYhDon5t",
        "RT @SaltAndReality In 2011, BongBong Marcos admitted in an interview w/ Raisa Robles that HE & HIS Father tried in 1986 to withdraw $213 million from Credit Suisse thru friend Mike de Guzman. It was part of the money that grew to $658 million that was awarded & given back to the Phil. Gov't in 2003 https://t.co/1PBVOazcum",
        "RT @SaltAndReality Did You Know? In 2015 under the PNoy Admin, the average inflation was 1.5% and the average price of Onions was 65.29/kg for white & 69.53/kg for red onions? It was 2nd lowest inflation rate since 1960 next to Tita Cory's 0.8% inflation in '86. Marcos had the highest at 50% in '84 https://t.co/gMXAmKFpfP",
        "RT @natoreyes No to Marcos royal junket Amid the economic crisis and historic P13.6 trillion in govt debt, Mr. Marcos should forgo his attendance at the coronation of King Charles in London. Taxpayers should not pay for this royal junket. It does not serve any national interest. https://t.co/RA3UKx5x8A",
        "RT @sonnyafrica Mga di ordinaryong Pilipino na sure winners from Pres. Marcos’s Maharlika Fund? Its Board of Directors who may get up to ₱23.3M each in compensation. If so, putting them among top 20 highest paid govt officials. Paid over 200 times what average minimum wage earner gets today. https://t.co/v0A73pXiR5",
        "RT @SaltAndReality To explain the Marcos ill gotten wealth, a myth was created that Marcos was already rich bef. he was president. However, in 1955 Marcos narrated how he borrowed 96,000 pesos to buy the San Juan home he was renting& pay its mortgage balance. Why need a loan if he was rich already? https://t.co/AJlIZJnygD",
        "RT Šlishalucena Toming us joking? We're going to go around because the cost of living is not easy, oil and transportation costs of poverty and hunger. It's 500K drivers, 300K operators, 2M families and the Filipino community are at stake at the Jeepney Phaseout! ottps/tco/1Ra8cEN",
        "RT @SaltAndReality PNoy said in his 2011 SONA \"Ang sa Pilipinas ay sa Pilipinas, kapag tumapak ka sa Recto Bank, para ka na ring tumapak sa Recto Avenue\". In 2013 he sued China in the Permanent Court of Arbitration & in 2016 the Court sided with the Philippines concluding \"no legal basis for China\" https://t.co/Qyyic6QWVo",
        "RT @ABSCBNNews Sen. Risa Hontiveros took a swipe at President Ferdinand Marcos Jr., who also serves as the Agriculture chief, as she urged the need to appoint a permanent DA secretary amid looming issues in the country's agriculture. READ: https://t.co/TOWGx7qMeM https://t.co/sGKWHxDXpY",
        "RT @jmschumey The name Marcos is a red flag to a prudent investor. The world knows how the Marcos family plundered the Philippines. Kaya puro pledge lang ang nakukuha ni Jr.",
        "RT @jcpunongbayan While Marcos Jr. & co. were busy promoting their pseudo-sovereign wealth fund called \"Maharlika Investment Fund\" at Davos last January, net foreign direct investments dropped by 45.7% from from the previous year. 😬 https://t.co/TVqiGN1hq9 https://t.co/i2nK2PcDcK"
      ],
      [
        "RT @business Philippine President Ferdinand Marcos Jr. is set to hold a summit with Japanese Prime Minister Fumio Kishida in Tokyo as the two US allies seek to boost cooperation amid China’s growing power in the region https://t.co/BoYVetam5v",
        "RT @IndoPac_Info Chinese harassment is unfolding just east of Philippine-held Loaita (Kota) Island, at the western edge of the #Philippines' exclusive economic zone.",
        "RT @apocalypseos 🇵🇭🤝🇨🇳 President Ferdinand R. Marcos Jr. & President Xi Jinping witnessed the signing of bilateral agreements between the Philippines & People’s Republic of China representing cooperation on a broad range of areas: agriculture, infrastructure, maritime security cooperation, etc. https://t.co/Jl1O1hmZuZ",
        "RT öbongarcos Little by little, inflation rate is increasing in the country by reducing 7.6% for the month of March from 8.6% in February. Government incentives for the rise of our economy and the quality of life of each Filipino family. tils:/tco./V8 MIKOEN",
        "RT öbongmarcos We signed 7 agreements in the sector of impriturukation, agriculture, distribution, and digitalization with Prime Minister Fumio Škishida230 today. We are bailing that these agreements will contribute to our country’s further growth. Hetps:/tco./64C4ZTux",
        "RT öbongmarcos Happy Day of Freedom on every Filipino corner of the world! As we celebrate the success of the nation’s ancestors and heroes, 125 years ago, you should expect our steps, such as the Philippine Development Plan, in the formation of a... hatps:/tco/9DOsWUHWd",
        "RT @pnagovph GLOBAL TOURISM AMBASSADOR. Pres. Ferdinand Marcos Jr. on Thursday awarded actress and digital influencer FilAm Vanessa Anne Hudgens the Global Tourism Ambassador Award as part of the admin’s ongoing efforts to promote PH tourism & raise the country’s global status. | 📷 @pcogovph https://t.co/ped8pexfs5",
        "RT @pcogovph President Ferdinand R. Marcos Jr.’s good economic stewardship resulted in the Philippines posting 7.6 percent full-year growth in 2022, the highest in 46 years since the country recorded 8.8 percent growth in 1976. READ: https://t.co/XLRxNZO8Kt https://t.co/kIbH8zrPEk",
        "RT @pcogovph The Philippines is leading the economic recovery and performance not only in the Asia-Pacific but in the whole world, President Ferdinand R. Marcos Jr. said Saturday. Read: https://t.co/2Ej0pr43Pi https://t.co/LDN4O1RrdF",
        "RT öbongmarcos In 1500 families from Gingoog City we have given cash assistance and other food and relief packages to our visit to their area. ottps:/t.co/5ZH4LNG0",
        "RT @pcogovph President Ferdinand R. Marcos Jr. has secured an investment commitment from ride-hailing service Grab, which could translate into 500,000 jobs. Read: https://t.co/UMwPB5IwL7 https://t.co/eahTAgTOxb",
        "RT @pcogovph President Ferdinand R. Marcos Jr. expressed elation Friday over the country’s 7.6 percent annual growth in 2022, stressing his administration’s major thrust is to attract foreign investments to sustain such growth rate and development. READ: https://t.co/1ijmA1eNAM https://t.co/EoOAXmYovI",
        "RT öbongmarcos Isa combined steps toward the more connected Philippines took place today when we inaugurated Caloocan-España Section of the North Luzon Expressway Connctor.",
        "RT @pcogovph The Philippine economy will continue to grow through the rest of the year with aggressive efforts of the Marcos government to usher the country toward post-pandemic recovery, an economist said on Monday. READ: https://t.co/IeCCOFzjme https://t.co/HeXAYF40Za",
        "RT @meettheearthorg Meet Lapu Lapu, 𝘁𝗵𝗲 𝗺𝗮𝗻 𝘄𝗵𝗼 𝗸𝗶𝗹𝗹𝗲𝗱 𝗠𝗮𝗴𝗲𝗹𝗹𝗮𝗻 𝗮𝗻𝗱 𝗽𝗼𝘀𝘁𝗽𝗼𝗻𝗲𝗱 𝘁𝗵𝗲 𝗣𝗵𝗶𝗹𝗶𝗽𝗽𝗶𝗻𝗲𝘀 𝗰𝗼𝗹𝗼𝗻𝗶𝘇𝗮𝘁𝗶𝗼𝗻 by more than 40 years! Do you know the real story of this Filipino hero... who maybe was actually Malay? Follow us to learn more!",
        "RT öbongmarcos Digital conctivity, energy, agriculture, tourism, flood control and many other promising projects are laid for every part of our society. This is the way to a New Philippines! ottps:/tco/NyW3Yqsuit",
        "RT öbongmarcos An inspiration for us is the inauguration of Mega Manufacti Plant of Mega Prime Foods, Inc. that began only in small business. Our government will support our local products and businessmen for the joint development of Filipinos. tils:/tco./KUh5yzV",
        "RT ösmningews Top 1 is the economy of the Philippines throughout Asia according to the World Economic Outlook released by the International Monetary Fund in April. öbongmarcos hops:/t.co/aQ3u1tuphZ",
        "RT öbongmarcos Our inauguration at the start of the National House for Filipino (4PH) Project in the Lawan Hills, Quezon City is only the beginning of our dream of having decent and affordable housing for our countrymen. HTtps:/t.co/Cu65nZQ",
        "RT öbongmarcos This is a big thing for our economy because each amount can contribute to improving the quality of our education, social and healthcare services, and building impritrukuration for the development of Filipino life. hetps://t.co/gIGWeD941"
      ]
    ],
    [
      [
        "Part of the largest-ever annual military exercises with the Philippines focuses on defending a strategic maritime transit point, the Bashi Channel https://t.co/emJO0muOTf @ChinaRealTime",
        "RT @kadonkey Two F/A-18E Super Hornets from the \"Blue Diamonds\" of Strike Fighter Squadron (VFA) 146 launch from the USS Nimitz (CVN 68) during flight operations in the Philippine Sea on 8 May 2023. (mcs Justin McTaggart) https://t.co/92WGLaSXlQ",
        "Philippine Coast Guard says Chinese ship aimed laser at one of its vessels - CNN https://t.co/y8TetRtEnp",
        "RT @ricwe123 So this bullshit CNN reporter is on a US navy plane. Flying all the way to the South China Sea and starts complaining. \"Why is this Chinese jet in such a close proximity\" 😂😂😂😂 https://t.co/wSMpdXvWvQ",
        "RT @maracepeda The Philippine Coast Guard’s April 18-24 patrol tallied 116 Chinese maritime militia vessels near Whitsun Reef and 18 anchored near Sabina Shoal, areas within the country’s exclusive economic zone in the South China Sea. 📷 PCG @straits_times https://t.co/cXhdcSS0EA",
        "RT @disclosetv NEW - Chinese fighter jet intercepted a U.S. Air Force plane over the South China Sea on May 26 — Pentagon https://t.co/rHXy0IuAo9",
        "RT @TheInsiderPaper BREAKING VIDEO 🚨 Chinese fighter jet performing \"an unnecessarily aggressive maneuver\" in front of U.S. Air Force aircraft over the South China Sea https://t.co/H6uXN7eTbK",
        "RT @Spriter99880 Large-scale naval exercises by the US, Taiwan, France and Australia, South Korea, Japan and the Philippines are taking place in the Pacific Ocean.They are closely followed by the Chinese and Russian navies. https://t.co/hzpA6bXz9O",
        "RT @TheInsiderPaper BREAKING 🚨 China says US warship ‘illegally intruded’ in South China Sea READ: https://t.co/3UWC0wZEIz https://t.co/9T2MuzIw2u",
        "RT @sentdefender The Republic of Korea Air Force (South Korea) has announced that earlier this morning it had Detected and Tracked at least 4 Chinese and 4 Russian Military Aircraft that had entered the Korean Air-Defense Identification Zone (KADIZ) over the Sea of Japan and the South China Sea… https://t.co/4GqKT6TCfM",
        "RT @TheStudyofWar #China-Taiwan Weekly Update The Chinese People’s Liberation Army Navy Shandong aircraft carrier strike group conducted exercises in the Philippine Sea 13-24 APR, likely to maintain operational readiness & demonstrate the ability to isolate the Philippines https://t.co/7YzZakXn2t https://t.co/4FY0TLXfH3",
        "RT @ravelesm The US Air Force has ZERO business being over the South China Sea!!!",
        "RT @medeabenjamin Unbelievable arrogance of US Navy challenging China’s “unlawful and sweeping maritime claims in the South China Sea.” Hello?!? It’s the South CHINA Sea!!! #ChinaIsNotOurEnemy https://t.co/BGvhGeLUJj via @asiatimesonline",
        "RT @sentdefender The U.S. State Department has demanded that the Chinese Military stop “Provocative and Unsafe Actions” in the South China Sea after 2 Ships from Chinese Coast Guard almost collided with a Philippines Coast Guard Ship on April 23rd. https://t.co/MaSLf0oxbK",
        "RT @IndoPac_Info 2) With dangerously close encounters at sea and in the air on the rise, a conflict is more likely to be triggered by an accident or miscalculation in the increasingly militarized South China Sea, said Zhou Bo, a former senior colonel in China’s People’s Liberation Army (PLA). https://t.co/mqSIHtH0iQ",
        "U.S. Navy Drills in South China Sea as Beijing Justifies Laser Attack https://t.co/fxvZjpQ56F via @BreitbartNews",
        "RT @Antiwarcom US Rehearses War With China on Philippine Island South of Taiwan The drills on Batan island are part of the US-Philippine Balikatan exercise by Dave DeCamp @DecampDave #China #Philippines #Taiwan #Balikatan2023 #Balikatan23 #Balikatan https://t.co/4MBd3KSpC0 https://t.co/GuTIL5b4qJ",
        "RT @CDonatac @tmt_kmaralit @TheManilaTimes Example #878 of “VP Harris doesn’t get the credit she deserves” Last year she visited President Marcos in the Philippines with a plan. Fast forward to present & Marcos now gives US military acces to 4 new bases including the South China Sea ,bringing total up to 10+ in the area",
        "Philippine Coast Guard says Chinese ship aimed laser at one of its vessels https://t.co/MRc9nNSDOr",
        "RT @GordianKnotRay #China Coast Guard ship 5304 has now begun patrolling the area about 5nm southwest of Sabina Shoal, deep within the #Philippines' exclusive economic zone. This is the first time I've observed this behavior from a CCG ship (though maritime militia remain posted inside the shoal). https://t.co/OB56snGouu"
      ],
      [
        "RT @cnnphilippines BREAKING: President Ferdinand Marcos Jr. signs into law a measure that amends the code providing fixed terms for ranking officials of the Armed Forces of the Philippines. Story soon on https://t.co/Ni4v3zQWgA https://t.co/ntifpw1FQg",
        "RT @opgovph President Ferdinand R. Marcos Jr. delivered a speech at the Philippine Military Academy (PMA) Alumni Homecoming, where he praised the institution for producing selfless individuals who have defended the country and preserved its democratic ideals.",
        "RT @USPacificFleet #HazeGray: USS Wayne E. Meyer (DDG 108) steams near the aircraft carrier USS Nimitz (CVN 68) in the South China Sea. The Nimitz Carrier Strike Group is in U.S. 7th Fleet conducting routine operations. #USNavy #USSNimitz 📸 MC3 Hannah Kantner @SurfaceWarriors https://t.co/gA8uH6UpRz",
        "RT @pcogovph President Ferdinand R. Marcos Jr. on Saturday night hosted a concert for the personnel of the Armed Forces of the Philippines (AFP) and their families. Read: https://t.co/TZWatJbTBn https://t.co/FE61Udt0uj",
        "RT @pcogovph The national government is determined to provide housing for the country’s uniformed personnel, President Ferdinand R. Marcos Jr. said on Tuesday, as he vowed to continue working to give the police and the military decent shelter. Read: https://t.co/dlWvG4wAfE https://t.co/MLG7wNsZ3Q",
        "RT @philly_florida Biden is building FOUR MORE MILITARY BASES in the Philippines to deter China's aggression in the western Pacific and Republicans call him \"weak on China\". Yet, practically all of MAGAWORLD will believe what their cult leaders say.",
        "RT @USPacificFleet Here we go! Nimitz Carrier Strike Group (NIMCSG) and Makin Island Amphibious Ready Group (MKI ARG), with embarked 13th Marine Expeditionary Unit (MEU), conduct combined expeditionary strike force (ESF) operations this week in the South China Sea. @INDOPACOM @US7thFleet https://t.co/WFivjozMjt",
        "RT @natoreyes We condemn in no uncertain terms the hostile actions of the Chinese Coast Guard in Ayungin Shoal which is well within the exclusive economic zone of the Philippines and is not part of China’s territorial waters under international law. https://t.co/zc9Y17GpeD",
        "RT @scotthortonshow US Patrol Over South China Sea Flies Within 500 Feet of Chinese Fighter Jet",
        "RT @ABC A Chinese J-16 jet fighter flew directly in front of a U.S. surveillance plane in international airspace over the South China Sea, forcing the U.S. Air Force plane to fly through the fighter's wake turbulence and causing the U.S. aircraft to shake. https://t.co/OSz1emHIyP https://t.co/KrKujgAQQv",
        "RT News5PH U.S. denounced the reported use of the laser of the Chinese Coast Guard against the Philippine Coast Guard’s BRP Malapscua in February 6 in the West Philippine Sea. #5 HTtps:/t./cojNKzR36",
        "RT @GerminalBooks Let us remember Benito and Wilma Tiamzon, fighters for democracy and social emancipation in the Philippines! https://t.co/kJbiZt4thw",
        "RT @USARPAC Get ready, Soldiers! The Philippine Army and the @USArmy prepare to commence the largest iteration of #ExerciseBalikatan, with over 17,000 troops participating. The annual bilateral exercise will take place throughout the #Philippines beginning April 11, 2023. https://t.co/Y1WkXK8PZK",
        "China warns Philippines not to give US more access to bases https://t.co/UvSpYGddOX",
        "RT @pcogovph Highlighting the critical role that the Philippine Coast Guard (PCG) plays, President Ferdinand R. Marcos Jr. reminded its personnel Thursday to always be ready and aware while doing their work in guarding the country’s boundaries. READ: https://t.co/0I8ugAsLLP https://t.co/gBNZjnGRgU",
        "RT @CNN United States and Philippine forces fired on a mock enemy warship in the South China Sea on Wednesday, the latest display of American firepower in Asia as tensions with China continue to rise https://t.co/eBMDpLj4hi",
        "RT @pcogovph President Ferdinand R. Marcos Jr. made history Wednesday as the first foreign head of state to be given full honors at the Pentagon under the administration of US President Joseph Biden. Read: https://t.co/NKVjs4dOFf https://t.co/keb50xqXav",
        "RT @ItsTheEnforcer ⚡️BREAKING: A United States Naval Destroyer has successfully navigated through the South China Sea. This “freedom of navigation” mission sends a message to China that the U.S. will not adhere to illegal annexation of these waters. https://t.co/CuJaqbirUI",
        "RT @USNavy #NavyPartnerships look good! 🤝 🇯🇵 ⚓ 🇺🇸 The #USSNimitz (CVN 68) Carrier Strike Group and the units from the @jmsdf_pao_eng conducted bilateral exercises in the Philippine Sea, March 23-26. Read More 👇 https://t.co/ANZLGDnoOt https://t.co/XOVH3odN1W",
        "RT @japantimes A U.S. Navy destroyer sailed near one of the most important man-made and Chinese-controlled islands in the South China Sea on Monday, in a freedom of navigation mission that Beijing denounced as illegal. https://t.co/u7kIemIdqG"
      ]
    ]
  ]
}